In [22]:
import pandas as pd
df=pd.read_csv('agora.csv')
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

# StandardScaler

In [23]:
from sklearn.preprocessing import StandardScaler

In [24]:
standardScaler=StandardScaler()

In [25]:
# drop column
new_df=df.drop(['Area','Profit'],axis=1)

In [26]:
new_df.head()

   Marketing Spend  Administration  Transport
0        114523.61       136897.80  471784.10
1        162597.70       151377.59  443898.53
2        153441.51       101145.55  407934.54
3        144372.41       118671.85  383199.62
4        142107.34        91391.77  366168.42

# fit_transform

In [27]:
new_df_fit_transform= standardScaler.fit_transform(new_df)

In [28]:
df.columns

Index(['Marketing Spend', 'Administration', 'Transport', 'Area', 'Profit'], dtype='object')

# Convert into data frame

In [29]:
output=pd.DataFrame(new_df_fit_transform,columns=['Marketing Spend', 'Administration', 'Transport'])

In [30]:
output.head()

   Marketing Spend  Administration  Transport
0         0.897913        0.560753   2.165287
1         1.955860        1.082807   1.929843
2         1.754364       -0.728257   1.626191
3         1.554784       -0.096365   1.417348
4         1.504937       -1.079919   1.273550